<!-- dflook/terraform-github-actions {"workspace":"trixie","backend_type":"remote","plan_modifier":"e3630f9001b9936667c4e3e06530ade2c1fc9a214786147ee8133ccbea4f2d1c","backend":"ac17402b6d387829d9b5f0e694e30e6aab8535072430e86bd3c04de3a2a019d4","plan_job_ref":"Job Test actions using target, replace, and exclude #39 at https://github.com/dflook/terraform-github-actions/actions/runs/23739200412","plan_hash":"235cfd4efd21b71b3d12a731c2e576e2afb80ea1f1cc28d00be0a4f631589bad","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __trixie__ workspace
Targeting resources: `random_string.foreach["hello"]`
With variables: `length = 6`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be created
+   resource "random_string" "foreach" {
+       id          = (known after apply)
+       length      = 6
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   foreach = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #39](https://github.com/dflook/terraform-github-actions/actions/runs/23739200412)
<details open><summary>Outputs</summary>

```hcl
count   = "hAS3J"
foreach = "0qpiak"
```
</details>